# ISingleServerService Interface (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ISingleServerService Interface
Members See Also
---
The base interface class for all single-server services.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public interface ISingleServerService : IExternalService
```

Visual Basic
---
```text
Public Interface ISingleServerService _
	Inherits IExternalService
```

Visual C++
---
```text
public interface class ISingleServerService : IExternalService
```

# Remarks
Both single-server and multi-server services may have more than one server registered for them. The difference between these two kinds is while there can only be one active server at any given time for a single-sever service, there may be a set of active servers assigned for a multi-server service.
ISingleServerService does not have any specific methods (currently) added to those inherited from the common IExternalService interface.
# See Also
ISingleServerService Members
Autodesk.Revit.DB.ExternalService Namespace